<template>
  <div class="log">
    <!-- <div class="nav">
      <ul>
        <li class="n-item" v-for="(item,index) in log" :key="index">
          <a :class="{active:active==index}" @click="scrollIntoView(index)">{{item.title}}</a>
        </li>
      </ul>
    </div>-->
    <div class="item">
      <!-- <div :id="'i-'+index" class="time-line-item" v-for="(item,index) in log" :key="index">
      <h3>{{item.title}}</h3>-->
      <div class="time-line-item">
        <h3>更新记录</h3>
      </div>
      <h5 style="padding-bottom: 12px;font-size: 15px;font-weight: 100;margin-left: 24px;">累计：{{log.length}}次提交</h5>
      <ul>
        <li v-for="(list,index1) in log"
            color="blue"
            :key="index1">
          <span class="date">{{list.date}}</span>
          <span>{{list.desc}}</span>
        </li>
      </ul>
      <!-- <Timeline>
        <TimelineItem v-for="(list,index1) in log" color="blue" :key="index1">
          <span class="date">{{list.date}}</span>
          <span>{{list.desc}}</span>
        </TimelineItem>
      </Timeline>-->
      <!-- </div> -->
    </div>
  </div>
</template>
<script>
export default {
  methods: {
    scrollIntoView (index) {
      this.active = index;
      document.getElementById("i-" + index).scrollIntoView(false);
    }
  },
  data () {
    return {
      active: 0,
      log: [
        { date: "2021-03-20 15:11:30",desc:"增加主题颜色"},
{ date: "2021-03-20 14:37:51",desc:"优化编辑弹出框明细表样式"},
{ date: "2021-03-20 14:30:02",desc:"修复明细表格错位"},
{ date: "2021-03-20 14:22:12",desc:"优化主从明细加载demo"},
{ date: "2021-03-20 14:07:32",desc:"替换默认图片"},
{ date: "2021-03-20 13:50:18",desc:"修复自定义二次打开$tabs时参数丢失的问题"},
{ date: "2021-03-20 13:49:53",desc:"缩进用户管理页面宽度"},
{ date: "2021-03-20 13:35:47",desc:"增加table使用示例及文档"},
{ date: "2021-03-20 12:39:06",desc:"优化表单demo"},
{ date: "2021-03-20 00:02:39",desc:"增加查询界面table表格编辑demo"},
{ date: "2021-03-20 00:02:05",desc:"增加查询界面table可以直接对表格编辑功能"},
{ date: "2021-03-19 22:22:20",desc:"增加H5下拉框只读字典翻译"},
{ date: "2021-03-14 23:41:43",desc:"增加一对一、一对多详细使用demo"},
{ date: "2021-03-06 17:39:37",desc:"增加生成前端页面生成到指定文件夹下(原来生成到项目类库名下,原有文件不受影响)"},
{ date: "2021-03-06 17:37:56",desc:"重命名删除方法"},
{ date: "2021-03-06 17:36:42",desc:"增加表单只读时日期格式化处理"},
{ date: "2021-03-06 17:36:07",desc:"增加table多列合并显示demo"},
{ date: "2021-02-28 22:11:26",desc:"优化table示例样式"},
        { date: "2021-02-28 21:53:55",desc:"简化多租户配置及文档"},
{ date: "2021-02-28 18:59:57",desc:"完善voltable从后台加载demo"},
{ date: "2021-02-01 20:12:23",desc:"增加表单年月查询"},
{ date: "2021-02-01 18:23:19",desc:"设置表单多图上传时默认累开启追加功能(以前多图上传重新选择时会移除原来的图片)"},
{ date: "2021-02-01 18:21:15",desc:"修复table表格文件下载路径指向错误的问题"},
{ date: "2021-01-31 16:00:04",desc:"增加http.js post方法第4个参数(可以设置自定义响应类型，请求头等，更多参数具体参照axios文档或源码)"},
{ date: "2021-01-30 23:56:59",desc:"增加指定默认排序字段与排序方式文档"},
{ date: "2021-01-30 22:22:47",desc:"增加代码生成器日期组件年月类型，查询/编辑类型选择year_month"},
{ date: "2021-01-30 22:21:48",desc:"增加iview表单日期年月选择及自定义格式"},
{ date: "2021-01-30 22:20:54",desc:"修复火狐table组件checkbox错位问题"},
{ date: "2021-01-24 22:05:35",desc:"修复多选类型，导出excel文件没有转换数据源的问题"},
{ date: "2021-01-23 13:48:48",desc:"移除无用文件"},
{ date: "2021-01-22 19:39:06",desc:"修复一对一从表点击编辑按钮时没有加载从表数据(点击快捷编辑的不受影响)"},
{ date: "2021-01-16 12:11:41",desc:"添加代生成页面表单编辑器图片上传配置"},
{ date: "2021-01-16 11:51:48",desc:"完善文档"},
{ date: "2021-01-16 11:46:12",desc:"增加表格内容超出后是否自动换行属性text-inline（默认不换行）"},
{ date: "2021-01-16 11:24:21",desc:"增加viewgrid、volform集成编辑器功能"},
{ date: "2021-01-16 11:23:14",desc:"代码生成器集成编辑器生成功能"},
{ date: "2021-01-16 09:30:52",desc:"修复http请示loading状态消失问题"},
        { date: "2021-01-10 00:55:17",desc:"完善文档"},
{ date: "2021-01-10 00:12:57",desc:"增加新建、编辑前可以阻止弹出框弹出(使用方法见：组件api->viewgrid文档)"},
{ date: "2021-01-09 23:48:05",desc:"增加代码生成器设置table排序功能"},
{ date: "2021-01-09 23:12:56",desc:"优化table显示td单元格大小"},
{ date: "2021-01-09 22:35:18",desc:"修复mysql使用dapper批量插入乱码的问题(由Flyash提供)"},
{ date: "2021-01-09 22:21:01",desc:"增加H5 table加载后的方法"},
{ date: "2021-01-09 22:13:38",desc:"调整文件点击下载方式"},
{ date: "2021-01-01 17:50:42",desc:"优化页面加载"},
{ date: "2021-01-01 17:49:06",desc:"优化登陆页面"},
{ date: "2021-01-01 17:07:42",desc:"修改页面加载样式，修改文件index.html,App.vue"},
{ date: "2021-01-01 16:59:59",desc:"优选代码生成器提示只能选择一个主键字段"},
{ date: "2021-01-01 16:44:54",desc:"优化导入excel时字典数据确实时提示信息"},
{ date: "2021-01-01 16:40:45",desc:"优化基础控制器(现在可以重写基础控制器方法)"},
{ date: "2020-12-29 22:05:51",desc:"提供最新sqlserver数据库脚本"},
{ date: "2020-12-29 12:25:21",desc:"优化首页菜单组件"},
{ date: "2020-12-28 23:00:23",desc:"优化首页白色主题背景颜色"},
{ date: "2020-12-28 22:59:52",desc:"优化首页菜单只显示根据节点为0的数据"},
{ date: "2020-12-27 19:04:44",desc:"完善文档"},
{ date: "2020-12-27 19:03:00",desc:"增加上传组件默认base64的支持"},
{ date: "2020-12-27 18:26:35",desc:"增加菜单不显示也可以分配仅限功能，需要更新文件VolElementMenu.vue  VolElementMenuChild.vue  Sys_Menu.vue   Sys_MenuService.cs  UserContext.cs"},
{ date: "2020-12-27 13:38:48",desc:"增加编辑保存后不重置分页页数(停留在当前页的数据)"},
{ date: "2020-12-27 13:12:54",desc:"增加表单render渲染额外属性"},
{ date: "2020-12-26 23:29:07",desc:"增加主从表demo"},
{ date: "2020-12-26 19:21:44",desc:"移除模板多余引用"},
{ date: "2020-12-21 19:40:45",desc:"增加菜单收缩功能更新文件：更新文件VolElementMenuChild.vue 、VolElementMenu.vue 、Index.vue"},
        { date: "2020-12-19 13:36:32", desc: "优化角色上级角色字段界面编辑或者新建时可以选择任意节点" },
        { date: "2020-12-19 13:29:06", desc: "增加前端禁止缓存与完善其他文档" },
        { date: "2020-12-19 13:09:50", desc: "增加table单元格为img时，可以自定义formatter及对base64图片的默认支持" },
        { date: "2020-12-19 12:47:06", desc: "设置编辑器demo禁用缓存keepAlive" },
        { date: "2020-12-19 12:37:09", desc: "修复自定义导出列配置属性为不显示时导出表头没有转换的问题" },
        { date: "2020-12-16 20:53:25", desc: "优化日志文件" },
        { date: "2020-12-16 20:52:39", desc: "优化代码生成器命名空间" },
        { date: "2020-12-13 15:29:34", desc: "增加自定义按钮权限控制操作文档" },
        { date: "2020-12-13 14:44:12", desc: "设置表单只读时也可以设置额外属性" },
        { date: "2020-12-13 14:30:15", desc: "添加table背景颜色文档" },
        { date: "2020-12-13 14:00:14", desc: "增加table单元格颜色" },
        { date: "2020-12-13 12:45:16", desc: "增加查询页面模板默认ref=grid属性" },
        { date: "2020-12-13 12:36:26", desc: "修复表单select/checkbox为只读时字典没有转换的问题" },
        { date: "2020-12-13 12:24:34", desc: "增加查询界面更多按钮项目hidden属性" },
        { date: "2020-12-13 12:41:11", desc: "修复H5图片上传路径错误的问题" },
        { date: "2020-12-13 12:40:41", desc: "优化白色主题" },
        { date: "2020-12-13 09:50:39", desc: "提交遗漏文件" },
        { date: "2020-12-06 17:26:31", desc: "添加自定义多个弹出框及其他文档" },
        { date: "2020-12-06 16:13:31", desc: "导入、审核、数据结构弹出框开启默认延迟加载" },
        { date: "2020-12-06 16:12:49", desc: "弹出框增加lazy延迟加载功能" },
        { date: "2020-12-06 15:49:28", desc: "增加viewgrid组件新建与编辑前异步方法同步处理" },
        { date: "2020-12-06 15:34:33", desc: "优化白色与黑色主题" },
        { date: "2020-12-06 15:24:01", desc: "增加h5图片上传示例" },
        { date: "2020-12-06 15:20:36", desc: "增加H5图片上传功能" },
        { date: "2020-12-06 10:36:58", desc: "优化H5标题栏在app上适配" },
        { date: "2020-12-02 12:39:48", desc: "修复前端tree转换三级节点为空的问题" },
        { date: "2020-11-29 16:45:20", desc: "更新图片" },
        { date: "2020-11-29 16:45:07", desc: "更新图片" },
        { date: "2020-11-29 16:34:26", desc: "更新demo" },
        { date: "2020-11-29 16:07:58", desc: "补充其他文档" },
        { date: "2020-11-29 16:06:12", desc: "增加查询界面hidden属性" },
        { date: "2020-11-29 16:00:41", desc: "修复tree节点转换排序可能错乱的问题" },
        { date: "2020-11-29 15:43:51", desc: "增加动态隐藏查询页面按钮文档" },
        { date: "2020-11-29 15:23:18", desc: "增加table编辑结束方法" },
        { date: "2020-11-29 15:00:52", desc: "优化登陆页面input标签样式" },
        { date: "2020-11-29 14:58:09", desc: "添加开发忽略文件" },
        { date: "2020-11-22 22:14:38", desc: "清理无用文件" },
        { date: "2020-11-22 18:13:05", desc: "替换logo" },
        { date: "2020-11-22 18:07:02", desc: "更换favicon" },
        { date: "2020-11-21 20:54:26", desc: "增加controller返回json原格式方法JsonNormal(默认是驼峰格式)" },
        { date: "2020-11-21 16:10:30", desc: "优化h5提示信息" },
        { date: "2020-11-21 15:57:15", desc: "优化首页白色主题" },
        { date: "2020-11-21 15:38:29", desc: "增加表单动态显示与隐藏文档及日志" },
        { date: "2020-11-21 15:27:32", desc: "增加表单动态控制标签显示、隐藏属性hidden" },
        { date: "2020-11-21 14:43:46", desc: "增加EF执行原生sql文档" },
        { date: "2020-11-21 14:36:18", desc: "修复sqlserver使用dapper操作AddRange批量写入主键类型判断错误" },
        { date: "2020-11-21 14:34:33", desc: "增加代码生成器使用说明" },
        { date: "2020-11-21 14:22:09", desc: "增加Controller、Service中构造方法获取实例文档，补充代码生成器文档" },
        { date: "2020-11-20 23:12:01", desc: "更新sqlserver字典数据库脚本" },
        { date: "2020-11-17 20:26:25", desc: "优化H5表单与http.js" },
        { date: "2020-11-14 15:04:01", desc: "增加快捷查询时日期单选操作" },
        { date: "2020-11-14 15:02:18", desc: "清理mysql开发版脚本" },
        { date: "2020-11-14 14:22:09", desc: "替换刷新token接口" },
        { date: "2020-11-14 14:19:36", desc: "增加h5文档" },
        { date: "2020-11-08 22:06:35", desc: "清理开发版不用数据库脚本" },
        { date: "2020-11-08 21:31:28", desc: "完善首页、菜单功能" },
        { date: "2020-11-08 19:47:08", desc: "优化table对selectList数据源的绑定" },
        { date: "2020-11-08 19:32:21", desc: "增加菜单列表渲染(与PC菜单同步)" },
        { date: "2020-11-08 17:58:16", desc: "优化H5表单多选功能" },
        { date: "2020-11-07 15:10:26", desc: "增加table点击行选中当前demo及其他文档" },
        { date: "2020-11-07 15:06:52", desc: "增加el-table的点击行事件添加到扩展方法中" },
        { date: "2020-11-07 14:01:35", desc: "增加编辑表单自定义验证demo" },
        { date: "2020-11-07 13:21:47", desc: "修复model验证不能识别负数的问题" },
        { date: "2020-11-02 18:49:46", desc: "修复表单只有一个input时按回车自动提交的问题，修复级联类型判断错误的问题" },
        { date: "2020-11-01 18:09:26", desc: "增加框架自动生成iview级联组件及文档" },
        { date: "2020-11-01 12:43:23", desc: "增加table显示、隐藏序号、checkbox属性" },
        { date: "2020-10-31 19:00:01", desc: "增加编辑表单第4种render渲染demo" },
        { date: "2020-10-31 18:40:17", desc: "优化H5表单编辑与查询" },
        { date: "2020-10-30 19:38:50", desc: "增加动态显示隐藏table列功能及demo、文档" },
        { date: "2020-10-25 15:47:55", desc: "添加iview级联组件中 change-on-select属性到volform表单中" },
        { date: "2020-10-25 15:45:44", desc: "移植后台页管理面到H5(见H5第4个菜单)" },
        { date: "2020-10-25 15:43:29", desc: "移植后台页管理面到H5(见H5第4个菜单)" },
        { date: "2020-10-20 12:45:46", desc: "优化自定义sql执行判断条件" },
        { date: "2020-10-18 11:06:57", desc: "element table编辑时增加iview input组件on-keypress事件" },
        { date: "2020-10-17 01:01:13", desc: "增加代码生成器编辑与查询类型time" },
        { date: "2020-10-17 00:56:49", desc: "表单组件增加iview time组件" },
        { date: "2020-10-17 00:43:26", desc: "增加区间查询demo" },
        { date: "2020-10-17 00:35:07", desc: "增加查询表单重置后方法" },
        { date: "2020-10-17 00:05:12", desc: "增加excel导入时可以添加其他参数" },
        { date: "2020-10-16 23:13:57", desc: "增加上传excel组件时可添加其他参数同时提交到后台" },
        { date: "2020-10-16 23:11:44", desc: "修复结束编辑时，element table高版本属性获取不到的问题" },
        { date: "2020-10-11 18:03:41", desc: "增加table编辑时点击其他行结束编辑状态(默认鼠标离开结束编辑，)" },
        { date: "2020-10-11 18:01:13", desc: "增加文档" },
        { date: "2020-10-11 16:59:57", desc: "优化代码生成器table编辑方式" },
        { date: "2020-10-11 15:00:55", desc: "移除table第一行强制排序" },
        { date: "2020-10-09 19:03:06", desc: "增加路由keepAlive属性设置不缓存组件(默认缓存组件)" },
        { date: "2020-09-26 11:49:08", desc: "修复table编辑时表格验证最大值取值错误的问题" },
        { date: "2020-09-26 11:34:59", desc: "修复远程搜索自定义url不生效的问题" },
        { date: "2020-09-20 16:33:31", desc: "移除未实现的EF调用存储过程的方法,增加EF调用原生sql参数化查询FromSqlInterpolated" },
        { date: "2020-09-20 16:21:01", desc: "增加排序表达式的null判断" },
        { date: "2020-09-20 16:18:36", desc: "修复dapper事务嵌套异常的问题" },
        { date: "2020-09-20 16:14:08", desc: "增加导入excel时，后台对非空数据源的值判断" },
        { date: "2020-09-20 16:11:22", desc: "优化导入excel文件提示" },
        { date: "2020-09-20 16:10:26", desc: "增加级联@on-change事件" },
        { date: "2020-09-20 15:17:52", desc: "完善文档" },
        { date: "2020-09-13 18:28:00", desc: "增加表单[FormFields]拼写错误兼容" },
        { date: "2020-09-12 00:12:24", desc: "同步数据库mysql/pgsql脚本" },
        { date: "2020-09-12 00:10:49", desc: "完善第二种布局文档及其他文档" },
        { date: "2020-09-11 23:37:07", desc: "增加第二种查询布局方式" },
        { date: "2020-09-06 02:21:01", desc: "完善文档" },
        { date: "2020-09-06 01:26:30", desc: "增加table有数据源的列可以移除或自定义显示背景颜色及点击事件；增加添加行方法时设置默认字段(解决编辑状态下编辑值可能不刷新的问题)" },
        { date: "2020-09-05 23:57:42", desc: "增加textarea标签的最小高度item.minRows属性" },
        { date: "2020-09-03 14:25:44", desc: "修复voltable编辑类型为input时onChange不触发的问题" },
        { date: "2020-09-02 09:28:18", desc: "增加table数据字典key为数字类型时的二次判断" },
        { date: "2020-08-30 19:20:14", desc: "修改开发版说明" },
        { date: "2020-08-30 19:18:24", desc: "修复首页日期星期天不显示的问题" },
        { date: "2020-08-30 18:36:07", desc: "增加从编辑框中再弹出框选择数据文档及其他文档完善" },
        { date: "2020-08-30 15:42:49", desc: "优化导入成功后的提示信息" },
        { date: "2020-08-29 01:29:33", desc: "添加table设置分页条大小、获取table所有行、获取table选中的行文档" },
        { date: "2020-08-29 00:42:04", desc: "增加table组件设置默认分页条大小" },
        { date: "2020-08-29 00:40:25", desc: "增加table组件设置分页条大小" },
        { date: "2020-08-29 00:10:36", desc: "优化数据源配置自定义sql提示信息" },
        { date: "2020-08-28 23:58:09", desc: "修复个人中心性别字段数据源配置错误的问题" },
        { date: "2020-08-28 23:49:31", desc: "优化用户管理页面新建用户后提示信息" },
        { date: "2020-08-26 19:17:34", desc: "增加编辑表动态设置只读，select事件触发文档" },
        { date: "2020-08-25 19:30:28", desc: "完善文档" },
        { date: "2020-08-22 04:04:42", desc: "添加多数据库访问、分库文档" },
        { date: "2020-08-18 18:55:12", desc: "完善文档" },
        { date: "2020-08-16 23:01:30", desc: "增加表单、table输入值后实时计算文档。增加项目启动异常处理方法文档" },
        { date: "2020-08-15 03:20:56", desc: "完善文档" },
        { date: "2020-08-15 03:19:28", desc: "增加多租户过滤，增加自定义原生sql查询" },
        { date: "2020-08-12 15:16:58", desc: "增加pgsql代码生成器timestamp字段类型" },
        { date: "2020-08-08 10:39:04", desc: "修复退出登陆切换帐号后权限缓存没刷新的问题" },
        { date: "2020-08-07 21:08:18", desc: "增加删除菜单功能，增加新建菜单时默认选中查询按钮权限" },
        { date: "2020-08-07 20:15:33", desc: "提供pgsql最新数据库脚本" },
        { date: "2020-08-07 20:05:45", desc: "完善对PGSQL数据库的支持" },
        { date: "2020-08-05 09:59:52", desc: "添加从表编辑时添加行的文档说明" },
        { date: "2020-08-05 09:58:17", desc: "修正pgsql表结构大小写问题" },
        { date: "2020-08-03 00:48:52", desc: "增加H5项目" },
        { date: "2020-08-01 20:57:07", desc: "移除无用代码" },
        { date: "2020-08-01 19:43:49", desc: "统一mysql脚本表名大写" },
        { date: "2020-08-01 19:22:38", desc: "修复Dapper删除方法执行错误的问题" },
        { date: "2020-07-31 20:18:18", desc: "增加手动打开与关闭tabs导航功能及文档" },
        { date: "2020-07-31 20:16:24", desc: "增加用户管理页面修改密码功能" },
        { date: "2020-07-31 20:12:06", desc: "修复权限枚举值遍历错误的问题" },
        { date: "2020-07-24 19:05:22", desc: "修改项目说明" },
        { date: "2020-07-24 19:01:09", desc: "增加form与table中日期onChange事件及文档" },
        { date: "2020-07-21 13:55:20", desc: "完善一对多保存Demo" },
        { date: "2020-07-19 01:31:54", desc: "替换redis组件CSReidsCore" },
        { date: "2020-07-19 00:56:59", desc: "回滚表单验证方法，修正表单验证方法文档" },
        { date: "2020-07-17 13:19:45", desc: "修复表单日期提示不消失的问题,增加表单强制同步验证" },
        { date: "2020-07-10 16:33:03", desc: "修复登陆页IE底部显示问题、优化首页菜单border、修改代码生成器字段描述" },
        { date: "2020-06-26 18:43:14", desc: "添加首页大屏显示" },
        { date: "2020-06-25 23:41:03", desc: "添加代码生成器对mysql字段smallint类型的支持" },
        { date: "2020-06-25 23:13:04", desc: "添加导出前方法处理及文档" },
        { date: "2020-06-25 23:03:24", desc: "增加onActivated方法(vue原生activated方法)" },
        { date: "2020-06-25 22:40:58", desc: "修复查询条件非法字段null过滤" },
        { date: "2020-06-24 17:15:51", desc: "优化登陆按钮操作(禁止重复点击)" },
        { date: "2020-06-24 12:02:24", desc: "修复select/selectList手动绑定数据源时key为数字0时的异常" },
        {
          date: "2020-06-20 02:17:52",
          desc:
            "增加volform、voltable对原生render的支持(现可任意扩展其他组件到form与table)"
        },
        { date: "2020-06-20 00:44:33", desc: "优化首页、首页皮肤" },
        {
          date: "2020-06-17 16:19:18",
          desc: "修复增加pgsql后，代码生成器判断类型错误的问题"
        },
        { date: "2020-06-16 09:50:17", desc: "增加登陆自动验证验证、UUID参数" },
        {
          date: "2020-06-16 09:45:54",
          desc: "重写登陆页面样式、增加登陆验证码、回车登陆"
        },
        { date: "2020-06-15 18:59:30", desc: "增加Dapper事务封装及文档" },
        {
          date: "2020-06-15 13:30:41",
          desc: "修复Dapper使用DbTransaction后没有释放的问题"
        },
        { date: "2020-06-14 21:53:33", desc: "增加pgsql脚本" },
        {
          date: "2020-06-14 21:52:17",
          desc: "增pgsql支持(生成代码获取表结构，同步表结构待完)"
        },
        { date: "2020-06-14 17:30:48", desc: "Update appsettings.json" },
        { date: "2020-06-14 16:38:58", desc: "增加对mysql数据类型double区分" },
        {
          date: "2020-06-14 16:12:12",
          desc:
            "增加代码生成器pgsql实体直实表名使用小写,dapper获取pgsql的NpgsqlConnection"
        },
        { date: "2020-06-14 15:28:33", desc: "增加pgsql数据库配置" },
        {
          date: "2020-06-14 15:20:50",
          desc: "Merge pull request #81 from xuegaoge/master"
        },
        { date: "2020-06-07 14:49:00", desc: "修复级联操作文档描述错误的问题" },
        {
          date: "2020-06-06 22:51:34",
          desc:
            "编辑表单类型selectList数据源为自定义sql并且key是数字时，强制转换成字符串"
        },
        {
          date: "2020-06-06 22:47:43",
          desc: "修改select编辑时手动级联文档说明"
        },
        {
          date: "2020-06-06 21:54:42",
          desc:
            "增加代码生成器文档，对select/selectList自定义sql数据源，在编辑时无法绑定默认值的问题说明"
        },
        {
          date: "2020-06-06 20:36:16",
          desc: "修复数据源为selectList时,key为数字0时不能转换文本的问题"
        },
        {
          date: "2020-06-06 20:02:51",
          desc: "修复单独使用table组件时,key为数字0时转换成文本失败的问题"
        },
        {
          date: "2020-06-03 14:03:18",
          desc: "增加voltabl文字对齐方式align（原生element table align属性）"
        },
        {
          date: "2020-06-03 13:43:26",
          desc: "优化路由切换加载状态，增加select手动级联文档"
        },
        {
          date: "2020-06-03 11:57:49",
          desc: "增加切换时路由加载提示(以前路由切换有明细卡顿现象)"
        },
        { date: "2020-06-03 10:27:26", desc: "优化权限分配左侧tree固定宽度" },
        {
          date: "2020-06-02 14:52:55",
          desc: "修复首页关闭tabs时，可能关闭两个tabs的问题"
        },
        {
          date: "2020-06-02 14:39:17",
          desc: "修复使用表别名时读取不到配置信息"
        },
        { date: "2020-06-01 13:22:21", desc: "增加http请求使用文档" },
        {
          date: "2020-06-01 13:16:58",
          desc: "增加[前端开发]级联文档与对象转换tree结构文档"
        },
        { date: "2020-06-01 12:57:20", desc: "增加顶部导tabs超出后滚动" },
        {
          date: "2020-06-01 12:55:50",
          desc: "增加功能将普通对象转换为tree结构"
        },
        {
          date: "2020-05-31 23:15:20",
          desc:
            "集成iview级联组件cascader到框架volform、viewgrid组件中；增加级联操作文档"
        },
        { date: "2020-05-31 21:15:33", desc: "移除无用文件夹test" },
        {
          date: "2020-05-31 15:45:37",
          desc: "优化角色管理页面及角色service代码"
        },
        { date: "2020-05-30 20:13:09", desc: "mysql最新脚本" },
        { date: "2020-05-29 14:57:23", desc: "修复mysql异常说明" },
        {
          date: "2020-05-25 00:43:43",
          desc: "角色权限分配，权限列表改为树形菜单"
        },
        {
          date: "2020-05-25 00:16:10",
          desc: "修复http同时发起多个请求时，遮罩层不能正确关闭的问题"
        },
        { date: "2020-05-24 20:35:15", desc: "增加代码生成器常用问题描述" },
        { date: "2020-05-17 15:17:01", desc: "优化首页tab选项卡border样式" },
        {
          date: "2020-05-17 15:04:17",
          desc:
            "修复代码生成器mysql获取表结构没有区分数据库的问题(感谢jerry指正)"
        },
        { date: "2020-05-12 10:08:23", desc: "优化手动上传组件图片选择器" },
        {
          date: "2020-05-08 11:16:44",
          desc: "添加mysql写入日志异常提示解决办法"
        },
        { date: "2020-05-08 11:13:09", desc: "补全mysql数据库字典编号" },
        {
          date: "2020-05-07 18:43:31",
          desc: "修改菜单与角色的父级id出现循环依赖时，给出提示并禁止修改"
        },
        {
          date: "2020-05-07 14:46:08",
          desc:
            "增加(导入、下载导入模板、导出表数据)时可以指定导入与导出字段(默认为界面上可以看到的字段)"
        },
        {
          date: "2020-05-03 12:12:08",
          desc: "增加代码生成页面对checkbox编辑时多选的支持"
        },
        {
          date: "2020-05-02 20:03:49",
          desc: "完善编辑器静态页面发布上传图片功能"
        },
        { date: "2020-05-01 21:43:26", desc: "增加可根据用户信息自定义数据源" },
        { date: "2020-04-27 11:00:50", desc: "更新数据库最新菜单表的脚本" },
        { date: "2020-04-27 10:36:55", desc: "添加全局缓存与读写分离文档" },
        { date: "2020-04-27 10:02:28", desc: "优化用户保存" },
        { date: "2020-04-26 20:08:41", desc: "增加树形菜单与table" },
        { date: "2020-04-25 20:36:49", desc: "文档整理" },
        {
          date: "2020-04-25 20:00:56",
          desc: "预留非对称主外键关系配置功能，待开发"
        },
        { date: "2020-04-25 11:16:57", desc: "优化白色主题菜单颜色" },
        { date: "2020-04-25 10:18:45", desc: "添加获取用户权限的重载方法" },
        {
          date: "2020-04-25 10:09:10",
          desc: "优化上传组件图片选择器默认大小图"
        },
        { date: "2020-04-24 18:10:44", desc: "增加EF更新时并发重试处理" },
        {
          date: "2020-04-24 11:45:29",
          desc: "修复导出数据源为自定义sql,类型转换异常的问题"
        },
        {
          date: "2020-04-21 23:00:06",
          desc:
            "增加没有编辑或新建权限时，也可以通过buttons属性添加自定义弹出框按钮"
        },
        { date: "2020-04-21 20:17:25", desc: "修复首页字符拼写错误" },
        { date: "2020-04-21 10:58:15", desc: "将默认皮肤黑色改为蓝色" },
        {
          date: "2020-04-20 14:43:39",
          desc: "修复动态刷新数据源文档描述错误的问题"
        },
        {
          date: "2020-04-14 19:55:14",
          desc: "增加Mysql数据库使用Dapper批量修改实体功能"
        },
        { date: "2020-04-11 21:20:04", desc: "增加项目部署及部署错误处理文档" },
        { date: "2020-04-11 18:49:33", desc: "移除使用了C#8.0语法的代码" },
        {
          date: "2020-04-10 13:05:23",
          desc: "修复自定义sql数据源key为数字时，表单查询时条件不起作用的问题"
        },
        {
          date: "2020-04-10 10:01:43",
          desc: "添加table列为编辑列时可formatter操作"
        },
        { date: "2020-04-07 23:43:16", desc: "完善文档" },
        { date: "2020-04-07 22:02:49", desc: "增加数字排版" },
        {
          date: "2020-04-07 21:41:24",
          desc: "增加主从表，可单独对从表上传图片(文件)功能"
        },
        { date: "2020-04-05 21:21:18", desc: "优化菜单保存后提示信息" },
        { date: "2020-04-05 20:48:02", desc: "优化排序字段" },
        {
          date: "2020-04-05 11:29:36",
          desc: "修复实体全属性校验判断错误的问题"
        },
        {
          date: "2020-04-04 12:44:56",
          desc: "优化voltable组件单独使用时数据绑定select的key类型"
        },
        {
          date: "2020-04-03 23:13:05",
          desc: "移除无用代码，增加一对多(不限从表数量)实战开发"
        },
        { date: "2020-04-03 23:07:04", desc: "添加最新菜单脚本" },
        { date: "2020-04-02 18:26:41", desc: "优化皮肤样式" },
        { date: "2020-04-02 17:47:23", desc: "增加换皮肤功能" },
        {
          date: "2020-04-02 17:43:59",
          desc: "修复点击非标准菜单可以重复显示的问题"
        },
        { date: "2020-04-02 17:36:23", desc: "增加皮肤切换功能" },
        {
          date: "2020-03-31 18:37:56",
          desc: "增加Dapper对mysql数据库Guid映射"
        },
        { date: "2020-03-31 13:47:14", desc: "增加查询按钮组非递归深拷贝" },
        {
          date: "2020-03-30 20:42:58",
          desc: "添加一对一从表编辑或新建时，可设置hidden属性控制按钮显示/隐藏"
        },
        { date: "2020-03-29 09:56:00", desc: "优化菜单保存验证" },
        { date: "2020-03-28 19:30:39", desc: "增加文件上传时可选择追加文件" },
        { date: "2020-03-27 20:17:57", desc: "优化axios请求失败提示" },
        { date: "2020-03-25 17:10:01", desc: "优化扩展排序" },
        {
          date: "2020-03-24 10:10:30",
          desc: "移除mysql连接字符串AllowLoadLocalInfile属性"
        },
        { date: "2020-03-23 19:10:26", desc: "修改代码生成器文档参数描述" },
        { date: "2020-03-19 23:28:22", desc: "文档整理" },
        {
          date: "2020-03-19 21:50:16",
          desc: "修复table表格属性为img多图片时不能预览大图的问题"
        },
        {
          date: "2020-03-18 22:10:29",
          desc: "导出数据时，默认导出table上可见的列"
        },
        { date: "2020-03-18 22:07:11", desc: "修改备注说明" },
        { date: "2020-03-17 13:00:17", desc: "优化菜单自定义按权限按钮显示" },
        { date: "2020-03-15 21:55:10", desc: "添加预请求过期时间" },
        { date: "2020-03-15 20:42:55", desc: "移除后台校验日期限制" },
        { date: "2020-03-15 20:42:13", desc: "优化多值in查询" },
        { date: "2020-03-15 20:41:41", desc: "优化table图片显示" },
        {
          date: "2020-03-14 14:32:50",
          desc: "添加table编辑demo，增加文档说明"
        },
        {
          date: "2020-03-14 13:29:14",
          desc:
            "增加table组件可始终开启编辑状态，增加单元格编辑类型switch组件onChange事件"
        },
        {
          date: "2020-03-12 19:41:52",
          desc: "增加viewgird组件可手动刷新字典数据源方法reloadDicSource"
        },
        { date: "2020-03-12 10:44:59", desc: "优化select自动开启查询" },
        { date: "2020-03-10 17:26:21", desc: "优化多字段排序" },
        { date: "2020-03-10 11:13:55", desc: "优化查询排序" },
        { date: "2020-03-09 13:26:01", desc: "优化快速查询字段数据源绑定" },
        { date: "2020-03-09 09:42:51", desc: "移除对map文件的打包" },
        {
          date: "2020-03-09 09:42:10",
          desc: "修复快速查询字段数据源无法绑定的问题绑定"
        },
        { date: "2020-03-03 16:55:22", desc: "优化代码生成器" },
        { date: "2020-03-03 15:44:52", desc: "添加文档说明" },
        { date: "2020-03-03 12:20:45", desc: "优化配置文件与demo" },
        { date: "2020-03-02 22:37:43", desc: "优化加载提示" },
        { date: "2020-03-02 20:15:26", desc: "优化表单验证及代码生成器" },
        { date: "2020-02-23 18:37:32", desc: "文档整理" },
        { date: "2020-02-14 21:45:38", desc: "优化单选事件触发" },
        { date: "2020-02-12 23:13:29", desc: "修改表单验证不能同步的问题" },
        {
          date: "2020-02-08 14:43:21",
          desc: "修复element table表格缩放后错行的问题"
        },
        { date: "2020-02-07 17:38:42", desc: "增加table选中行事件及demo" },
        { date: "2020-02-06 14:08:52", desc: "移除未使用旧项目vol.web" },
        {
          date: "2020-02-06 11:26:09",
          desc: "移除未使用的未分离旧项目vol.web"
        },
        {
          date: "2020-02-04 14:11:38",
          desc: "修复代码生成器项目命名空间加载无效的的问题"
        },
        {
          date: "2020-02-04 10:58:01",
          desc:
            "修复select远程搜索数组分割错误的问题及select清空时同时清空数据源"
        },
        { date: "2020-02-02 21:19:20", desc: "表单优化" },
        {
          date: "2020-02-02 20:42:19",
          desc: "优化el-scrollbar滚动条z-index属性"
        },
        { date: "2020-02-02 19:47:31", desc: "修改model样式z-index" },
        { date: "2020-02-02 17:25:46", desc: "增加可复用的后台通用参数校验" },
        { date: "2020-02-02 14:47:51", desc: "更新版本" },
        { date: "2020-02-01 23:09:10", desc: "优化远程搜索" },
        { date: "2020-02-01 12:31:59", desc: "基础组件优化" },
        {
          date: "2020-02-01 01:16:09",
          desc: "升级.netcore 3.1更新配置(位置已标注)"
        },
        { date: "2020-02-01 01:13:50", desc: "框架更新至.netcore 3.1" },
        { date: "2020-02-01 01:07:12", desc: "整理文档" },
        { date: "2020-02-01 00:58:43", desc: "优化远程搜索" },
        { date: "2020-01-21 21:50:39", desc: "增加table表单求和实时计算" },
        { date: "2020-01-06 12:02:50", desc: "优化代码生成器table高度适应" },
        { date: "2020-01-06 11:55:53", desc: "消息提示时间延长到5秒" },
        { date: "2020-01-05 23:19:43", desc: "优化表单远程搜索" },
        { date: "2020-01-05 22:45:17", desc: "优化table显示select多选编辑" },
        { date: "2020-01-05 22:10:43", desc: "添加字典远程搜索与文档" },
        {
          date: "2020-01-05 19:33:19",
          desc: "增加编辑时支持key.value对应的多选"
        },
        { date: "2020-01-02 16:43:02", desc: "最新mysql表" },
        {
          date: "2020-01-02 12:52:51",
          desc: "添加编辑、新建时支持使用多选框操作"
        },
        { date: "2019-12-31 17:13:23", desc: "添加upload文件夹" },
        { date: "2019-12-23 19:04:43", desc: "添加登陆页面工信部网站备案号" },
        { date: "2019-12-23 19:04:37", desc: "无" },
        { date: "2019-12-23 11:01:14", desc: "添加最新菜单脚本" },
        { date: "2019-12-23 10:22:27", desc: "增加静态页面提示" },
        { date: "2019-12-22 14:47:20", desc: "增加静态页面发布描述" },
        { date: "2019-12-22 14:19:27", desc: "优化代码生成器页面" },
        {
          date: "2019-12-22 01:14:09",
          desc: "增加静态页面发布App_News功能，优化代码生成器"
        },
        { date: "2019-12-22 01:10:33", desc: "增加静态页面发布模板" },
        {
          date: "2019-12-22 01:09:48",
          desc: "增加文档编辑器，增加静态页面发布功能，优化基础组件"
        },
        {
          date: "2019-12-21 22:42:51",
          desc: "修复代码生成器页面没有设置父级Id默认值的问题"
        },
        {
          date: "2019-12-19 17:47:42",
          desc: "添加actived触发时，是否刷新页面属性activatedLoad"
        },
        { date: "2019-12-19 17:36:37", desc: "优化代生成模板" },
        {
          date: "2019-12-19 17:34:38",
          desc:
            "增加Dapper调用批量删除、更新(mysql未实现)、写入的实现，优化Dapper使用"
        },
        { date: "2019-12-19 11:30:40", desc: "优化表单只读时提示" },
        {
          date: "2019-12-18 13:33:09",
          desc: "修复votable编辑i-switch标签bool类型判断"
        },
        {
          date: "2019-12-17 18:08:56",
          desc: "增加代码生成后的页面对从表编辑的扩展"
        },
        {
          date: "2019-12-17 17:48:43",
          desc:
            "增加voltable可使用button操作进行编辑、编辑select标签事件触发，编辑开始与编辑完成事件扩展、增加td单元格额外选项标签"
        },
        {
          date: "2019-12-17 11:45:21",
          desc:
            "增加代码生成的表单是否默认加载数据属性，增加table编辑的select可筛选，增加selectList校验"
        },
        { date: "2019-12-17 10:36:11", desc: "优化加载提示" },
        { date: "2019-12-14 11:17:28", desc: "优化头像默认显示" },
        {
          date: "2019-12-14 00:00:27",
          desc: "voltable自定义排序参数及组件文档。。。"
        },
        { date: "2019-12-13 23:58:56", desc: "增加明细表自定义排序" },
        { date: "2019-12-13 23:06:14", desc: "增加表单、table图片预览功能" },
        { date: "2019-12-12 09:48:18", desc: "增加table编辑bool属性显示" },
        { date: "2019-12-11 15:47:57", desc: "优化只读表单字段显示" },
        {
          date: "2019-12-11 11:31:43",
          desc: "修复获取当前用户所有下级角色字段传入错误的问题"
        },
        { date: "2019-12-10 14:15:12", desc: "优化表单数字验证" },
        {
          date: "2019-12-10 11:12:18",
          desc: "增加表单列只读时，可将字段设置为方法进行值计算"
        },
        { date: "2019-12-08 22:42:13", desc: "优化上传组件选择器显示" },
        {
          date: "2019-12-08 22:28:30",
          desc: "新建用户时将默认头像改为自己选择头像"
        },
        {
          date: "2019-12-08 22:02:57",
          desc: "优化角色新建或修改时，禁止相同的角色名"
        },
        { date: "2019-12-08 22:01:41", desc: "优化角色页面上级角色选择" },
        { date: "2019-12-08 22:01:00", desc: "优化switch默认值设置" },
        {
          date: "2019-12-08 20:55:00",
          desc: "添加表单switch对boolean值的处理"
        },
        {
          date: "2019-12-08 20:42:26",
          desc: "修复表单不能重置switch标签默认值的问题"
        },
        {
          date: "2019-12-08 20:25:05",
          desc: "增加数据源绑定设置默认值时对number与字符串的区分"
        },
        { date: "2019-12-07 13:03:11", desc: "添加table可单选属性" },
        { date: "2019-12-07 12:49:09", desc: "移除不用代码" },
        {
          date: "2019-12-07 11:57:34",
          desc: "修改代码生成器对mysql字段bool类型判断"
        },
        {
          date: "2019-12-06 20:54:09",
          desc: "增加代码生成器可生成模糊查询功能"
        },
        {
          date: "2019-12-06 20:06:30",
          desc:
            "table添加行时，如果是可编辑的switch类型没有初始值时，设置默认值为0"
        },
        { date: "2019-12-06 19:50:00", desc: "增加页面刷新加载效果" },
        {
          date: "2019-12-06 19:46:09",
          desc:
            "添加表单支持额外标签显示及事件处理，增加table表单元格可下载文件"
        },
        {
          date: "2019-12-06 18:38:26",
          desc: "修复编辑权限大小写判断错误的问题"
        },
        {
          date: "2019-12-05 13:12:05",
          desc:
            "修复代码生成器bigint识别错误的问题，优化代码生成器同步表结构的功能"
        },
        { date: "2019-12-02 17:34:42", desc: "优化代码生成器排序规则" },
        { date: "2019-12-02 15:26:38", desc: "添加可自定义编辑框大小" },
        {
          date: "2019-12-02 14:35:30",
          desc: "修复代码生成器不能手动同步表别名的数据结构"
        },
        { date: "2019-12-02 10:38:35", desc: "添加文件上传前，上传后扩展处理" },
        {
          date: "2019-12-01 19:59:37",
          desc: "添加用户只能操作自己创建的数据(及当前用户下角色)Demo"
        },
        {
          date: "2019-11-28 18:37:56",
          desc: "修复表单图片属性只读时，图片相对路径没有正确解析的问题"
        },
        {
          date: "2019-11-28 13:13:44",
          desc:
            "修复代码生成器对sqlserver数据非主键GUID生成的model错误的问题，修复从表别名后删除时未获取到真实表名的问题"
        },
        { date: "2019-11-28 11:50:47", desc: "优化登陆界面" },
        { date: "2019-11-27 15:02:22", desc: "优化表单组件对password的提示" },
        { date: "2019-11-27 13:50:36", desc: "添加分配菜单图标显示" },
        {
          date: "2019-11-27 13:13:22",
          desc: "增加编辑功能可上传文件(图片、excel及其他附件)"
        },
        {
          date: "2019-11-26 18:36:51",
          desc: "添加代码生成器对编辑功能可上传excel及附件"
        },
        { date: "2019-11-25 19:10:25", desc: "增加webapi文件wwwroot" },
        {
          date: "2019-11-25 19:08:27",
          desc: "修复代码生成器对mysql数据库表结构tinyint类型识别错误的问题"
        },
        {
          date: "2019-11-25 18:32:52",
          desc: "增加表单文件上传功能(table多图片显示待完)"
        },
        { date: "2019-11-25 18:31:28", desc: "添加对文件上传功能的支持" },
        { date: "2019-11-25 16:11:06", desc: "调整修改密码弹出框大小" },
        { date: "2019-11-24 15:00:26", desc: "修改字典异常记录" },
        {
          date: "2019-11-24 14:49:38",
          desc: "增加获取字典时对执行自定义sql异常的信息的记录"
        },
        {
          date: "2019-11-24 13:32:27",
          desc: "修复编辑页面从表分页后再打开其他页面，分页信息没有重置的问题"
        },
        {
          date: "2019-11-24 12:08:43",
          desc: "修复删除功能没有接收返回值的问题"
        },
        { date: "2019-11-24 08:45:35", desc: "增加本地服务器访问静态文件" },
        {
          date: "2019-11-23 23:13:14",
          desc: "增加上传组件，可自定义上传任意文件"
        },
        { date: "2019-11-23 23:09:45", desc: "增加本地文件上传功能" },
        {
          date: "2019-11-22 17:52:43",
          desc: "增加ViewGrid组件获取选中行数据的组件"
        },
        {
          date: "2019-11-22 10:44:30",
          desc: "修复代码生成器没有生成表描述属性的问题"
        },
        { date: "2019-11-22 10:14:10", desc: "优化查询按钮显示" },
        { date: "2019-11-21 18:02:15", desc: "整理文档" },
        { date: "2019-11-21 18:01:50", desc: "Demo优化" },
        { date: "2019-11-21 17:59:22", desc: "解除代码生成器对类库开头限制" },
        { date: "2019-11-21 09:47:45", desc: "增加Mysql最新数据库脚本" },
        { date: "2019-11-20 17:14:58", desc: "调整表单demo适应" },
        { date: "2019-11-20 15:53:18", desc: "优化代码生成器" },
        {
          date: "2019-11-20 15:14:07",
          desc: "修复自动刷新Token后可能存在登陆不跳转的问题"
        },
        {
          date: "2019-11-20 12:02:01",
          desc: "增加封装组件对table属性MaxHeight的支持"
        },
        { date: "2019-11-19 11:49:11", desc: "增加transition动画显示页面" },
        { date: "2019-11-19 11:32:20", desc: "移除多余属性hasKeyField" },
        { date: "2019-11-19 11:08:23", desc: "优化Demo" },
        {
          date: "2019-11-19 10:53:04",
          desc: "优化表单对int.bigint.decimal数据类型的验证"
        },
        {
          date: "2019-11-18 18:45:28",
          desc:
            "修复select字典数据类型与绑定值的数据类型不一致时不能绑定默认值的问题"
        },
        { date: "2019-11-18 18:44:13", desc: "优化代码生成器" },
        {
          date: "2019-11-18 16:18:46",
          desc: "优化IE浏览器高级查询不起作用的问题"
        },
        { date: "2019-11-18 15:13:22", desc: "重新生成角色页面" },
        { date: "2019-11-18 14:44:32", desc: "修复表单验证提示错误" },
        { date: "2019-11-17 19:27:47", desc: "增加数据库菜单脚本" },
        { date: "2019-11-17 19:15:48", desc: "开发文档1.0" },
        { date: "2019-11-17 18:53:12", desc: "增加代码生成器对表别名的支持" },
        { date: "2019-11-17 18:52:30", desc: "增加代码生成器对表别名的支持" },
        { date: "2019-11-17 15:49:19", desc: "优化代码生成器" },
        { date: "2019-11-17 15:48:05", desc: "代码生成器优化" },
        {
          date: "2019-11-17 13:49:37",
          desc: "优化webapi构造方法及代码生成器模块"
        },
        { date: "2019-11-16 10:25:13", desc: "框架文档1.0" },
        { date: "2019-11-16 08:40:20", desc: "添加input标签  onKeyPress事件" },
        {
          date: "2019-11-15 23:34:10",
          desc: "增加表单类型为数字时，默认值为0"
        },
        {
          date: "2019-11-15 23:17:59",
          desc: "修复文档表单Demo自定义验证错误的问题"
        },
        {
          date: "2019-11-14 23:17:38",
          desc: "增加可自定义有数据库的table单元格td的背景颜色"
        },
        {
          date: "2019-11-14 23:05:44",
          desc: "增加快速查询字段为input标签时，可按回车键直接查询"
        },
        {
          date: "2019-11-14 22:50:52",
          desc: "添加table表可自定义有数据源单元格的背景颜色"
        },
        {
          date: "2019-11-14 22:36:28",
          desc: "增加HttpContext.Request<T>直接获取对象"
        },
        {
          date: "2019-11-13 23:46:01",
          desc: "增加代码生成器页面手动同步表结构的功能"
        },
        {
          date: "2019-11-13 23:38:35",
          desc: "增加代码生成器手动同步表结构功能(表字段发生变化)"
        },
        {
          date: "2019-11-13 21:38:00",
          desc: "修复mysql外键Guid识别错误的问题"
        },
        { date: "2019-11-12 14:27:37", desc: "优化表单对数字的验证" },
        { date: "2019-11-12 12:06:30", desc: "优化基础组件" },
        {
          date: "2019-11-12 12:01:39",
          desc: "增加可设置FixedToken属性标识方法的token永不过期"
        },
        { date: "2019-11-12 11:55:19", desc: "增加文档" },
        {
          date: "2019-11-12 11:50:04",
          desc:
            "增加可设置FixedTokenAttribute属性标识Token是否永远不过期,修复获取用户信息存在异常的问题"
        },
        {
          date: "2019-11-11 13:50:39",
          desc: "增加表单组件可设置lable宽度labelWidth属性"
        },
        { date: "2019-11-11 13:19:57", desc: "优化表单select验证" },
        {
          date: "2019-11-11 12:41:56",
          desc: "修复IE弹出框没有居中的问题，优化菜单保存功能"
        },
        {
          date: "2019-11-11 11:16:56",
          desc:
            "修复SaveChanges方法拼写错误的问题，增加菜单保存对表名重复性验证"
        },
        {
          date: "2019-11-08 15:19:02",
          desc: "修改菜单时限定菜单父ID不能是当前菜单的ID"
        },
        {
          date: "2019-11-07 11:13:20",
          desc: "增加导入excel时验证自定义sql的数据源"
        },
        {
          date: "2019-11-07 11:03:53",
          desc: "增加导入excel时验证自定义sql的数据源"
        },
        {
          date: "2019-11-06 18:27:57",
          desc: "table列的宽度超出时自动设置第一列为固定列"
        },
        { date: "2019-11-06 16:07:02", desc: "优化VolForm表单验证" },
        {
          date: "2019-11-04 15:00:59",
          desc: "修复table有查询条件时，第1页以后的数据没有带上查询条件的问题"
        },
        {
          date: "2019-11-04 13:25:54",
          desc: "固定菜单页面中其他权限弹出框的大小"
        },
        {
          date: "2019-11-04 09:53:00",
          desc: "添加Demo的扩展js中，扩展按钮使用描述"
        },
        {
          date: "2019-11-01 10:14:38",
          desc: "增加新建或编辑成功后可设置是否关闭弹出框"
        },
        {
          date: "2019-10-31 13:09:19",
          desc: "修复页面刷新后顶部导航状态消失的问题"
        },
        {
          date: "2019-10-31 12:56:43",
          desc: "增加代码生成器对应表单渲染邮箱与手机号码类型"
        },
        {
          date: "2019-10-31 12:52:46",
          desc: "增加表单邮箱格式、手机号码格式、自定义验证方法"
        },
        {
          date: "2019-10-31 10:42:37",
          desc: "优化编辑弹出框自适应功能，增加编辑弹出框可以自行设置高度与宽度"
        },
        { date: "2019-10-29 17:13:42", desc: "增加代码生成器非空判断" },
        { date: "2019-10-29 09:51:24", desc: "修改日志处理" },
        { date: "2019-10-25 17:30:40", desc: "添加编辑基础扩展方法" },
        {
          date: "2019-10-25 13:51:57",
          desc: "添加编辑按钮可自定义设置hidden与disabled属性"
        },
        {
          date: "2019-10-25 13:02:42",
          desc: "添加代码生成器对mysql数据库的兼容处理"
        },
        { date: "2019-10-24 13:36:15", desc: "优化首页获取菜单权限验证规则" },
        {
          date: "2019-10-24 13:34:42",
          desc: "修复表单select组件为只读的属性时没有绑定数据源"
        },
        {
          date: "2019-10-24 13:16:56",
          desc: "增加mysql数据库日志批量写入失败解决说明"
        },
        {
          date: "2019-10-23 18:44:17",
          desc: "添加select组件默认超过10个item开启搜索功能"
        },
        {
          date: "2019-10-22 18:55:00",
          desc:
            "修复第一次弹出框时获取不到子组件的问题,增加记录当前编辑行的属性"
        },
        {
          date: "2019-10-22 15:41:27",
          desc: "修改sqlserver表SellOrderList外键Order_Id字段类型错误的问题"
        },
        { date: "2019-10-22 10:28:45", desc: "修改项目启动介绍说明" },
        {
          date: "2019-10-21 19:02:19",
          desc: "添加IE9以上版本的支持,添加打包后文件后缀加上时间戳解决缓存问题"
        },
        { date: "2019-10-18 15:47:00", desc: "增加textarea标签可自行设定高度" },
        {
          date: "2019-10-16 18:35:55",
          desc: "修复sqlserver字段guid小写的问题"
        },
        {
          date: "2019-10-16 18:30:15",
          desc: "修复sqlserver字段guid小写的问题"
        },
        { date: "2019-10-15 14:23:59", desc: "修改dapper查询异常" },
        {
          date: "2019-10-14 14:43:39",
          desc: "增加sqlserver2012以下版本使用说明"
        },
        {
          date: "2019-10-12 12:36:29",
          desc: "屏蔽select组件max-tag-count属性"
        },
        {
          date: "2019-10-12 09:48:40",
          desc: "增加表单查询/刷新时重置table分页信息"
        },
        { date: "2019-10-11 14:24:44", desc: "增加其他组件菜单->选择图标功能" },
        { date: "2019-10-10 10:44:54", desc: "增加Demo常用功能介绍" },
        { date: "2019-10-09 16:21:25", desc: "增加发布前端项目运行命令" },
        { date: "2019-10-09 16:19:21", desc: "增加demo接口" },
        {
          date: "2019-10-09 15:41:04",
          desc: "增加其他组件菜单下http请求Api的Demo"
        },
        {
          date: "2019-10-09 15:33:10",
          desc: "增加其他组件菜单下http请求，vuex状态管理等Demo"
        },
        { date: "2019-09-29 17:29:41", desc: "修改Demo描述" }
      ]
    };
  }
};
</script>

<style scoped  lang="less" >
.time-line-item {
  margin-top: 40px;
}
.time-line-item h3 {
  font-size: 22px;
  font-weight: 400;
  margin: 0 0 15px;
  color: #1f2d3d;
}
.date {
  border-right: 1px solid #009688;
  margin-right: 30px;
  padding-right: 30px;
}
li {
  list-style: none;
  font-size: 15px;
  padding: 5px;
}
li:before {
  content: "";
  display: inline-block;
  width: 9px;
  height: 9px;
  background-color: #40ad44;
  border-radius: 50%;
  margin-right: 10px;
  top: -1px;
  position: relative;
}
.log {
  display: flex;
  .active {
    color: #409eff !important;
  }
  .nav {
    width: 300px;
    ul {
      z-index: 999999;
      top: 90px;
      position: fixed;
    }
    a {
      font-size: 15px;
      color: #737070;
      line-height: 40px;
      height: 40px;
      margin: 0;
      padding: 0;
      text-decoration: none;
      display: block;
      position: relative;
      -webkit-transition: 0.15s ease-out;
      transition: 0.15s ease-out;
    }
  }
  .item {
    flex: 1;
  }
}
.content {
  max-width: 800px;
  padding-top: 40px;
}
</style>
